#Найти и вывести на экран квадраты и кубы чисел от 2 до 5.
for i in range(2, 6):
    square = i**2
    cube = i**3
    print("число:" , i , "кврадрат:", square , "куб:" , cube )