# Приложение СТРАХОВАЯ КОМПАНИЯ для некоторой организации. БД должна
# содержать таблицу Договор со следующей структурой записи: дата заключения, страховая
# сумма, вид страхования, тарифная ставка и филиал, в котором заключался договор.

import sqlite3 as sq

with sq.connect("company_strah.db") as con:
    cur = con.cursor()
    cur.execute("DROP TABLE IF EXISTS services")
    cur.execute("""CREATE TABLE IF NOT EXISTS services(data_zak date not null,
    strah_sum decimal(10,2) not null, strah_type text not null, stavka decimal(5,2) not null,
    filial varchar(20) not null)""")

    information = [
        ("10.10.2020 10:10:10", 100000, "Страхование жизни", 30, "Первый филиал"),
        ("10.10.2020 10:10:11", 100000, "Страхование жизни", 40, "Первый филиал"),
        ("10.10.2020 10:10:12", 100000, "Страхование жизни", 50, "Первый филиал"),
        ("10.10.2020 10:10:13", 100000, "Страхование жизни", 60, "Первый филиал"),
        ("10.10.2020 10:10:14", 100000, "Страхование жизни", 70, "Первый филиал"),
        ("10.10.2020 10:10:15", 100000, "Страхование жизни", 80, "Первый филиал"),
        ("10.10.2020 10:10:16", 100000, "Страхование жизни", 90, "Первый филиал"),
        ("10.10.2020 10:10:17", 100000, "Страхование жизни", 100, "Первый филиал"),
        ("10.10.2020 10:10:18", 100000, "Страхование жизни", 110, "Первый филиал"),
        ("10.10.2020 10:10:19", 100000, "Страхование жизни", 120, "Первый филиал")
    ]
    cur.executemany("INSERT INTO services VALUES (?, ?, ?, ?, ?)", information)